# parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]], #2 (P1 backbone)
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11 (P2 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24 (P3 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37 (P4 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]

# 2 (P1 backbone)
# 11 (P2 backbone)
# 24 (P3 backbone)
# 37 (P4 backbone)
# 50 (P5 backbone)


# yolov7 head
head:
  [
   # bifusion module 1
   [50, 1, SPPCSPC, [512]],  # 51
   #    RB block1, route backbone P4+P3+P5
   #    output/current/shallow/deep layer depth 512/256/128/256
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [256, 1, 1]],
   [[37, 24, -1], 1, RBBlockA, [512, '256,1,1;128,1,2', 2, 'nearest']],  # 53
   [-1, 2, Bottleneck, [512, False]],
   [-1, 2, BottleneckCSPB, [256]],  # 55
   
   #    RB block2, route backbone P3+P2+RB Block1
   #    output/current/shallow/deep layer depth 256/128/64/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[24, 11, -1], 1, RBBlockA, [256, '128,1,1;64,1,2', 2, 'nearest']],  # 57
   [-1, 2, Bottleneck, [256, False]],
   # end of bifusion module 1
   
   
   # bifusion module 2
   [37, 1, SPPCSPC, [256]],  # 59
   #    RBblock1, route backbone P3+P2+P4
   #    output/current/shallow/deep layer depth 512/128/64/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 2]],
   [[24, 11, -1], 1, RBBlockA, [512, '128,1,2;64,1,4', 2, 'nearest']],  # 61
   [-1, 2, Bottleneck, [512, False]],
   [-1, 2, BottleneckCSPB, [256]],  # 63
   
   #    RB block2, route backbone P2+P1+RB Block1
   #    output/current/shallow/deep layer depth 256/64/32/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[11, 2, -1], 1, RBBlockA, [256, '64,1,2;32,1,4', 2, 'nearest']],  # 65
   [-1, 2, Bottleneck, [256, False]],
   # end of bifusion module 2
   
   
   # bifusion module 3
   [24, 1, SPPCSPC, [128]],  # 67
   #    RBblock1, route backbone P2+P1+P3
   #    output/current/shallow/deep layer depth 512/64/32/64
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [64, 1, 4]],
   [[11, 2, -1], 1, RBBlockA, [512, '64,1,4;32,1,8', 2, 'nearest']],  # 69
   [-1, 2, Bottleneck, [512, False]],
   [-1, 2, BottleneckCSPB, [256]],  # 71
   
   #    RB block2, route backbone P1+P0+RB Block1
   #    output/current/shallow/deep layer depth 256/32/32/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[2, 1, -1], 1, RBBlockA, [256, '32,1,4;32,1,4', 2, 'nearest']],  # 73
   [-1, 2, Bottleneck, [256, False]],
   # end of bifusion module 3
   
   
   [[-1, 66, 58], 1, Concat, [1]], # 75 multi-pyramid fusion PY3/8
   [-1, 4, BottleneckCSPB, [128]], # 76 bottleneck = PY + 1
   [-1, 1, Conv, [256, 3, 1]],
   [[71, 63, 55], 1, Concat, [1]],  # 78 multi-pyramid fusion PY4/16
   [-1, 4, BottleneckCSPB, [256]], # 79 bottleneck = PY + 1
   [-1, 1, Conv, [512, 3, 1]],
   [[68, 60, 52], 1, Concat, [1]],  # 81 multi-pyramid fusion PY5/32
   [-1, 4, BottleneckCSPB, [512]], # 82 bottleneck = PY + 1
   [-1, 1, Conv, [1024, 3, 1]],
   
   [77, 1, RepConv, [256, 3, 1]],  # 84
   [80, 1, RepConv, [512, 3, 1]],  # 85
   [83, 1, RepConv, [1024, 3, 1]],  # 86

   [[84, 85, 86], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
